#### Импорт необходимых библиотек

In [2]:
import pandas as pd
import numpy as np

In [ ]:
assessments = pd.read_csv('assessments.csv')
courses = pd.read_csv('courses.csv')
studentAssessment = pd.read_csv('studentAssessment.csv')
studentRegistration = pd.read_csv('studentRegistration.csv')

#### Загрузка данных

In [3]:
assessments.head()

  code_module code_presentation  id_assessment assessment_type   date  weight
0         AAA             2013J           1752             TMA   19.0    10.0
1         AAA             2013J           1753             TMA   54.0    20.0
2         AAA             2013J           1754             TMA  117.0    20.0
3         AAA             2013J           1755             TMA  166.0    20.0
4         AAA             2013J           1756             TMA  215.0    30.0

### 1.Сколько студентов успешно сдали только один курс? (Успешная сдача — это зачёт по курсу на экзамене. Диапазон составляет от 0 до 100. Оценка ниже 40 неудачная/неуспешная сдача теста)
1. Из таблицы studentAssessment отобрал только тех, кто сдал экзамен успешно (40+ баллов).
2. Приджоинил к studentAssessment типы ассесментов из таблицы assessments, заранее отфильтровав только те, которые относятся к типу Exam.
3. С помощью group by посчитал количество уникальных успешно сданных экзаменов для каждого студента.
4. Посчитать количество студентов, у которых успешно сдан только 1 экзамен.

In [4]:
task_01 = studentAssessment.query('score>39').merge(assessments.query('assessment_type == "Exam"')[['id_assessment']].drop_duplicates(), how='inner', on='id_assessment')

In [5]:
task_01.head()

   id_assessment  id_student  date_submitted  is_banked  score
0          24290      559706             234          0   78.0
1          24290      559770             230          0   54.0
2          24290      560114             230          0   64.0
3          24290      560311             234          0  100.0
4          24290      560494             230          0   92.0

In [6]:
task_01=task_01.groupby('id_student', as_index=False)[['id_assessment']].nunique().rename({'id_assessment':'success_count'}, axis=1)

In [7]:
task_01.head()

   id_student  success_count
0       23698              1
1       24213              1
2       27116              1
3       28046              1
4       28787              1

In [8]:
task_01.query('success_count==1')[['id_student']].nunique()

id_student    3802
dtype: int64

### 2. Выявить самый сложный и самый простой экзамен: найти курсы и экзамены в рамках курса, которые обладают самой низкой и самой высокой завершаемостью
1. Приджоинил к таблице studentAssessment типа ассессментов из таблицы assessment, отфильтровав только те, которые относятся к экзаменам.
2. Посчитал количество уникальных успешных попыток для каждого экзамена с помощью groupby
3. Посчитал количество неуспешных попыток
4. Создал новое поле - завршаемость
5. Вывести id ассессментов - самого сложного и самого простого

In [9]:
task_02 = studentAssessment.merge(assessments.query('assessment_type == "Exam"')[['id_assessment']].drop_duplicates(), how='inner', on='id_assessment')

In [10]:
task_02.assign(success = lambda x: (x.score > 39)
        .astype(int)).groupby('id_assessment', as_index=False)[['success']].aggregate({'success':(np.sum, len)}).assign(success_rate = lambda row: row.success['sum']/ row.success.len).sort_values(by='success_rate').reset_index(drop=True).id_assessment

0    25340
1    24299
2    25368
3    24290
4    25354
5    25361
Name: id_assessment, dtype: int64

###### Ответ: самый сложный экзамен - 25340, самый простой экзамен - 25361

### 3. По каждому предмету определить средний срок сдачи экзаменов (под сдачей понимаем последнее успешное прохождение экзамена студентом)

In [11]:
task_3 = studentAssessment.merge(assessments.query('assessment_type == "Exam"')[['id_assessment', 'code_module']], how = 'inner', on = 'id_assessment')

In [12]:
task_3.head()

   id_assessment  id_student  date_submitted  is_banked  score code_module
0          24290      558914             230          0   32.0         CCC
1          24290      559706             234          0   78.0         CCC
2          24290      559770             230          0   54.0         CCC
3          24290      560114             230          0   64.0         CCC
4          24290      560311             234          0  100.0         CCC

In [13]:
task_3.query('is_banked == 0').groupby('code_module', as_index = False).aggregate({'date_submitted':np.mean})

  code_module  date_submitted
0         CCC      239.408877
1         DDD      237.901445

### 4. Выявить самые популярные курсы (ТОП-3) по количеству регистраций на них. А также курсы с самым большим оттоком (ТОП-3)

1. Для каждого семестра в таблице studentRegistration рассчитал уникальное количество зарегистрировавшихся
2. Для каждого семестра в таблице studentRegistration рассчитал уникальное количество отписавшихся

In [14]:
task_4_top_3 = studentRegistration.groupby('code_module', as_index=False).id_student.nunique().sort_values('id_student', ascending=False).rename({'id_student':'registrations_count'}, axis=1).head(3)

In [15]:
task_4_top_3

  code_module  registrations_count
1         BBB                 7692
5         FFF                 7397
3         DDD                 5848

In [16]:
tasl_4_top_3_churn = studentRegistration[~studentRegistration.date_unregistration.isna()].groupby('code_module', as_index=False).id_student.nunique().sort_values('id_student', ascending=False).rename({'id_student':'unregistration_count'}, axis=1).head(3)

In [17]:
tasl_4_top_3_churn

  code_module  unregistration_count
1         BBB                  2314
5         FFF                  2249
3         DDD                  2065

### 5. Написать функцию на python, позволяющую строить когортный (семестровый) анализ. В период с начала 2013 по конец 2014 выявить семестр с самой низкой завершаемостью курсов и самыми долгими средними сроками сдачи курсов.

1. Из таблицы studentAssessment выдедил только те экзамены, которые не были зачтены ранее.
2. Рассчитал на основе поля score факт успешности экзамена.
3. Для успешных экзаменов выделил средние сроки их сдачи.
4. Для каждого семестра рассчитал среднюю завершаемость и средние сроки сдачи
5. Разметка студентов по кластерам с помощью np.digitize

In [18]:
task_5 = studentAssessment.query('is_banked == 0').merge(assessments.query('assessment_type == "Exam"')[['id_assessment','code_presentation']].drop_duplicates(), how = 'inner', on = 'id_assessment')

In [19]:
task_5=task_5.assign(success = lambda x: (x.score > 39).astype(int), success_date_submitted = lambda x: x.success * x.date_submitted)

In [20]:
task_5=task_5.groupby('code_presentation', as_index = False).aggregate({'success':[np.mean], 'success_date_submitted':[lambda x: np.average(x, weights=(x>0))]})

In [21]:
task_5.columns = task_5.columns.droplevel(level=1)

In [22]:
task_5.head()

  code_presentation   success  success_date_submitted
0             2013B  0.837209              230.164683
1             2013J  0.907025              239.509112
2             2014B  0.904013              232.997389
3             2014J  0.878659              243.680279

### 6. Используя python, постройте адаптированные RFM-кластеры студентов, чтобы качественно оценить аудиторию. В адаптированной кластеризации можно выбрать следующие метрики: R - среднее время сдачи одного экзамена, F - завершаемость курсов, M - среднее количество баллов, получаемое за экзамен.
 
1. Из таблицы studentAssessment отфильтровал те экзамены, которые не были перезачтены (is_banked ==0)
2. К этому датасету присоединил таблицу assessments, предварительно отфильтровал только те значения, в которых assessment_type == "Exam, и отобрал из assessments  только две колонки - id_assessment, code_presentation.
3. С помощью group by и np.mean посчитал для каждого студента средние показатели: завершаемость курса, время сдачи одного экзамена, количество баллов.
4. Получил интервалы по 25, 50 и 75 персентилям для каждой метрики (intervals)
5. Разметка студентов по кластерам с помощью np.digitize

In [46]:
def average (x):
    try:
        return np.average(x, weights=(x>0))
    except:
        return 0

In [47]:
prep = studentAssessment.query('is_banked ==0').merge(assessments.query('assessment_type == "Exam"')[['id_assessment', 'code_presentation']].drop_duplicates(), how='inner', on='id_assessment')

In [48]:
prep=prep.assign(success = lambda x: (x.score > 39).astype(int), success_date_submitted = lambda x: x.success * x.date_submitted).groupby('id_student', as_index=False).agg({'success':np.mean, 'success_date_submitted': np.mean, 'score':np.mean})

In [49]:
prep.head()

   id_student  success  success_date_submitted  score
0       23698      1.0                   243.0   80.0
1       24213      1.0                   236.0   58.0
2       27116      1.0                   243.0   96.0
3       28046      1.0                   237.0   40.0
4       28787      1.0                   243.0   44.0

In [50]:
intervals = {
    'R': list(prep.success_date_submitted.describe())[3:],
    'F': list(prep.success.describe())[3:5],
    'M': list(prep.score.describe())[3:]
}

In [51]:
intervals

{'R': [0.0, 230.0, 237.0, 243.0, 285.0],
 'F': [0.0, 1.0],
 'M': [0.0, 50.0, 66.0, 82.0, 100.0]}

In [52]:
prep.score.describe()

count    4633.000000
mean       65.117958
std        20.470561
min         0.000000
25%        50.000000
50%        66.000000
75%        82.000000
max       100.000000
Name: score, dtype: float64

In [55]:
task_06 = prep.assign(recency = lambda x: np.digitize(x.success_date_submitted, intervals.get('R')), frequency = lambda x: np.digitize(x.success, intervals.get('F')), monetary = lambda x: np.digitize(x.score, intervals.get('M')))[['id_student', 'recency', 'frequency', 'monetary']]

In [57]:
task_06

      id_student  recency  frequency  monetary
0          23698        4          2         3
1          24213        2          2         2
2          27116        4          2         4
3          28046        3          2         1
4          28787        4          2         1
...          ...      ...        ...       ...
4628     2694886        2          2         3
4629     2694933        2          2         3
4630     2695608        3          2         3
4631     2697181        2          2         3
4632     2698251        2          2         1

[4633 rows x 4 columns]